RosimarSilva/UsbReceiverHugo/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART0 Receive Data Source Select: LPUART_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 Transmit Data Source Select: LPUART0_TX pin */

/*! @name PORTD7 (number 64), Tx_usb
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Tx_Usb_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Tx_Usb_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Tx_Usb_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD6 (number 63), Rx_usb
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Rx_usb_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Rx_usb_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Rx_usb_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE0 (number 1), Sda
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Sda_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Sda_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Sda_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE1 (number 2), Scl
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Scl_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Scl_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Scl_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE29 (number 17), Wc
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Wc_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Wc_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Wc_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Wc_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Wc_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Wc_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE31 (number 19), Usb_on
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Usb_on_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Usb_on_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Usb_on_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Usb_on_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Usb_on_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Usb_on_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB0 (number 35), Analog2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Analog2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Analog2_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Analog2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB17 (number 40), Rele
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Rele_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Rele_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Rele_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Rele_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Rele_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Rele_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD1 (number 58), Led1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led1_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led1_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

