RosimarSilva/UsbReceiverHugo/board/pin_mux.h
/*! @name PORTD0 (number 57), Led2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led2_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led2_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led2_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led2_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC7 (number 56), Led3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led3_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led3_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led3_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led3_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB16 (number 39), Led4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led4_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led4_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led4_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led4_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led4_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led4_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA13 (number 29), Led5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led5_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led5_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led5_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led5_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA4 (number 26), Led6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led6_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led6_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led6_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led6_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led6_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led6_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC2 (number 45), Sw3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Sw3_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Sw3_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Sw3_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Sw3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Sw3_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Sw3_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC3 (number 46), Sw2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Sw2_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Sw2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Sw2_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Sw2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Sw2_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Sw2_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC1 (number 44), Ds1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Ds1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Ds1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Ds1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Ds1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Ds1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Ds1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC0 (number 43), Ds2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Ds2_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Ds2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Ds2_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Ds2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Ds2_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Ds2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB19 (number 42), Ds3
  @{ */

