RosimarSilva/UsbReceiverHugo/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Ds3_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Ds3_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Ds3_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Ds3_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Ds3_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Ds3_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB18 (number 41), Ds4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Ds4_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Ds4_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Ds4_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Ds4_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Ds4_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Ds4_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE22 (number 11), Analog1Dif1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Analog1Dif1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Analog1Dif1_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Analog1Dif1_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTE23 (number 12), Analog1Dif2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Analog1Dif2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Analog1Dif2_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Analog1Dif2_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTB1 (number 36), Analog3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Analog3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Analog3_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Analog3_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB2 (number 37), Analog4
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Analog4_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Analog4_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Analog4_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB3 (number 38), analog5
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Analog5_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Analog5_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Analog5_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC4 (number 53), PinoTensao1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PinoTensao1_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_PinoTensao1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PinoTensao1_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PinoTensao1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PinoTensao1_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PinoTensao1_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTC5 (number 54), PinoTensao2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PinoTensao2_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_PinoTensao2_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PinoTensao2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PinoTensao2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PinoTensao2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PinoTensao2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
